// ================字面量================
// 此时a只能为10，不能赋其他值
var a;
// 使用 | 来连接多个值。此时b只能为male或者female，不能赋其他值
var b;
b = "male";
b = "female";
// b = "other"
// ================字面量================
// ================联合类型================
// 使用 | 来连接多个类型（联合类型）
var c;
c = false;
c = "str";
// c = 1
// ================联合类型================
// ================any================
// any 表示任意类型，一个变量设置类型为any表示对该变量关闭了ts的类型检测
var d;
d = 10;
d = 'hello';
d = false;
// 声明变量如果不指定类型，ts解析器自动判断变量类型为any（隐式any）
var e;
e = 10;
e = 'hello';
e = true;
// any变量可以赋值给任何类型的变量
c = e;
console.log(c);
// ================any================
// ================unknown================
// unknown表示未知类型
var f;
f = 10;
f = 'hello';
f = false;
// unknown是一个类型安全的any，不能像any一样赋值给任何类型的变量
// c = f
// 类型判断
if (typeof f === "boolean") {
    c = f;
}
// 类型断言
c = f;
// ================unknown================
